["```\n    cat /proc/cpuinfo | egrep \"vmx|svm\"\n    ```", "```\n    virt-host-validate\n    ```", "```\n    libvirt-guests service, and then we get very surprised after we reboot our host. The result of libvirt-guests not being enabled is simple. When started, it suspends your virtual machines when you initiate shutdown and resumes them on the next boot. In other words, if you don't enable them, your virtual machines won't resume after the next reboot. Also, check out its configuration file, /etc/sysconfig/libvirt-guests. It's a simple text configuration file that enables you to configure at least three very important settings: ON_SHUTDOWN, ON_BOOT, and START_DELAY. Let's explain these:a) By using the `ON_SHUTDOWN` setting, we can select what happens with the virtual machine when we shut down your host since it accepts values such as `shutdown` and `suspend`.b) The `ON_BOOT` option does the opposite – it tells `libvirtd` whether it needs to start all the virtual machines on host boot, whatever their autostart settings are. It accepts values such as `start` and `ignore`.c) The third option, `START_DELAY`, allows you to set a timeout value (in seconds) between multiple virtual machine power-on actions while the host is booting. It accepts numeric values, with `0` being the value for parallel startup and *all other (positive) numbers* being the number of seconds it waits before it starts the next virtual machine.\n    ```", "```\n    libvirtd needs to be started for us to be able to create or run a KVM virtual machine.\n    ```", "```\nexport LIBVIRT_LOG_OUTPUTS=\"1:file:/var/log/libvirt_guests.log\"\n```", "```\nvirt-admin daemon-log-filters \"\"\n```", "```\nvirsh console kvm_domain_name\n```", "```\nengine-backup --mode=backup --file=backupfile1 --log=backup.log\n```", "```\nengine-backup --mode=restore --log=backup.log --file=backupfile1 --provision-db --provision-dwh-db --no-restore-permissions \n```", "```\nengine-upgrade-check\nyum update ovirt\\*setup\\*\nengine-setup\n```", "```\nyum -y update\n```"]