["```java\n/list), and /-<n> allow re-running of the snippets that have been run previously.\nJShell was able to provide the suggestion because the JAR file with the compiled Pair class was on the classpath (set there by default as part of JDK libraries). You can also add to the classpath any other JAR file with the compiled classes you need for your coding. You can do it by setting it at JShell startup by the option --class-path (can be also used with one dash -class-path):\n```", "```java\nShift + *Tab* and then *I* as described earlier.\n`<name or id>`: This is the name or ID of a specific snippet or method or type or variable (we will see examples later)`-start`: This shows snippets or methods or types or variables loaded at the JShell start (we will see later how to do it)`-all`: This shows snippets or methods or types or variables loaded at the JShell start and entered later during the session\n```", "```java\n/l s5command, for example, it will retrieve the snippet with ID s5:\n```", "```java\npair), saved the session entries in the file mysession.jsh (in the home directory), and closed the session. Let's look in the file mysession.jsh now:\n```", "```java\n7:\n```", "```java\n/o <file> that opens the file as the source input.\n```", "```java\njava -XX:CompileThreshold=500 -XX:-TieredCompilation Test\n```", "```java\npublic class HelloWorld {\n   public static void main(String... args) {\n       System.out.println(\"Hello, World!\");\n   }\n}\n```", "```java\njavac HelloWorld.java\n```", "```java\njaotc --output libHelloWorld.so HelloWorld.class\n```", "```java\njava -XX:AOTLibrary=./libHelloWorld.so HelloWorld\n```", "```java\njava -XX:AOTLibrary=./libHelloWorld.so -XX:+PrintAOT HelloWorld\n```", "```java\njaotc <options> <name or list>\n```", "```java\n    exclude sun.util.resources..*.TimeZoneNames_.*.getContents\\(\\)\\[\\[Ljava/lang/Object;\n    exclude sun.security.ssl.*\n    compileOnly java.lang.String.*\n\n    ```", "```java\njaotc --output libjava.base.so --module java.base\n```"]