["```js\\1\n\nThe `docker run` command downloads a Docker image, named on the command line, initializes a Docker container from that image, and then runs that container. In this case, the image, named `hello-world`, was not present on the local computer and had to be downloaded and initialized. Once that was done, the `hello-world` container was executed and it printed out these instructions.\n\nThe `docker run hello-world` command is a quick way to verify that Docker is installed correctly.\n\nLet's follow the suggestion and start an Ubuntu container:\n\n```", "```js\\1\n\nThe `clever_napier` name is the container name automatically generated by Docker. While the image name was `hello-world`, that was not the container name. Docker generated the container name so that you have a more user-friendly identifier for the containers than the hex ID shown in the `CONTAINER ID` column:\n\n```", "```js\\1\n\nThe `docker pull` command retrieves an image from a Docker repository and is conceptually similar to the `git pull` command, which retrieves changes from a `git` repository.\n\nThis downloaded four image layers in total because this image is built on top of three other images. We'll see later how that works when we learn how to build a Dockerfile. \n\nWe can query which images are stored on our laptop with the following command:\n\n```", "```js\\1\n\nNotice that the actual `delete` operation works with the SHA256 image identifier.\n\nA container can be launched with the image, as follows:\n\n```", "```js\\1\n\nThe **`docker exec`** command lets you run programs inside the container. The `-it` option says the command is run interactively on an assigned terminal. In this case, we used the `mysql` command to run the MySQL client so that we could interact with the database. Substitute `bash` for `mysql`, and you will land in an interactive `bash` command shell.\n\nThis `mysql` command instance is running inside the container. The container is configured by default to not expose any external ports, and it has a default `my.cnf` file. \n\nDocker containers are meant to be ephemeral, created and destroyed as needed, while databases are meant to be permanent, with lifetimes sometimes measured in decades. A very important discussion on this point and how it applies to database containers is presented in the next section.\n\nIt is cool that we can easily install and launch a MySQL instance. However, there are several considerations to be made:\n\n*   Access to the database from other software, specifically from another container\n*   Storing the database files outside the container for a longer lifespan\n*   Custom configuration, because database admins love to tweak the settings\n*   We need a path to connect the MySQL container to the AuthNet network that we'll be creating\n\nBefore proceeding, let's clean up. In a terminal window, type the following:\n\n```", "```js\\1\n\nWe'll be adding more scripts to this file. The `build-authnet` command builds a virtual network using the `bridge` driver, as we just discussed. The name for this network is `authnet`.\n\nHaving created `authnet`, we can attach containers to it so that the containers can communicate with one another.\n\nOur goal for the Notes application stack is to use private networking between containers to implement a security firewall around the containers. The containers will be able to communicate with one another, but the private network is not reachable by any other software and is, therefore, more or less safe from intrusion.\n\nType the following command:\n\n```", "```js\\1\n\nAt the moment, this won't show any containers attached to `authnet`. The output shows the network name, the IP range of this network, the default gateway, and other useful network configuration information. Since nothing is connected to the network, let's get started with building the required containers:\n\n```", "```js\\1\n\nThis does several useful things all at once. It initializes an empty database configured with the named users and passwords, it mounts a host directory as the MySQL data directory, it attaches the new container to `authnet`, and it exposes the MySQL port to connections from outside the container.\n\nThe `docker run` command is only run the first time the container is started. It combines building the container by running it for the first time. With the MySQL container, its first run is when the database is initialized. The options that are passed to this `docker run` command are meant to tailor the database initialization.\n\nThe `--env` option sets environment variables inside the container. The scripts driving the MySQL container look to these environment variables to determine the user IDs, passwords, and database to create.\n\nIn this case, we configured a password for the `root` user, and we configured a second user—`userauth`—with a matching password and database name.\n\nThere are many more environment variables available.\n\nThe official MySQL Docker documentation provides more information on configuring a MySQL Docker container ([https://dev.mysql.com/doc/refman/8.0/en/docker-mysql-more-topics.html](https://dev.mysql.com/doc/refman/8.0/en/docker-mysql-more-topics.html)).\n\nThe MySQL server recognizes an additional set of environment variables ([https://dev.mysql.com/doc/refman/8.0/en/environment-variables.html](https://dev.mysql.com/doc/refman/8.0/en/environment-variables.html)).\n\nThe MySQL server recognizes a long list of configuration options that can be set on the command line or in the MySQL configuration file ([https://dev.mysql.com/doc/refman/8.0/en/server-option-variable-reference.html](https://dev.mysql.com/doc/refman/8.0/en/server-option-variable-reference.html)).\n\nThe `--network` option attaches the container to the `authnet` network.\n\nThe `-p` option exposes a TCP port from inside the container so that it is visible outside the container. By default, containers do not expose any TCP ports. This means we can be very selective about what to expose, limiting the attack surface for any miscreants seeking to gain illicit access to the container.\n\nThe `--mount` option is meant to replace the older `--volume` option. It is a powerful tool for attaching external data storage to a container. In this case, we are attaching a host directory, `userauth-data`, to the `/var/lib/mysql` directory inside the container. This ensures that the database is not inside the container, and that it will last beyond the lifetime of the container. For example, while creating this example, we deleted this container several times to fine-tune the command line, and it kept using the same data directory.\n\nWe should also mention that the `--mount` option requires the `src=` option be a full pathname to the file or directory that is mounted. We are using ``pwd`` to determine the full path to the file. However, this is, of course, specific to Unix-like OSes. If you are on Windows, the command should be run in PowerShell and you can use the `$PSScriptRoot` variable. Alternatively, you can hardcode an absolute pathname.\n\nIt is possible to inject a custom `my.cnf` file into the container by adding this option to the `docker run` command:\n\n```", "```js\\1\n\nSo far, we have talked about the options for the `docker run` command. Those options configure the characteristics of the container. Next on the command line is the image name—in this case, `mysql/mysql-server:8.0`. Any command-line tokens appearing after the image name are passed into the container. In this case, they are interpreted as arguments to the MySQL server, meaning we can configure this server using any of the extensive sets of command-line options it supports. While we can mount a `my.cnf` file in the container, it is possible to achieve most configuration settings this way.\n\nThe first of these options, `--bind_address`, tells the server to listen for connections from any IP address.\n\nThe second, `--socket=/tmp/mysql.sock`, serves two purposes. One is security, to ensure that the MySQL Unix domain socket is accessible only from inside the container. By default, the scripts inside the MySQL container put this socket in the `/var/lib/mysql` directory, and when we attach the data directory, the socket is suddenly visible from outside the container.\n\nOn Windows, if this socket is in `/var/lib/mysql`, when we attach a data directory to the container, that would put the socket in a Windows directory. Since Windows does not support Unix domain sockets, the MySQL container will mysteriously fail to start and give a misleadingly obtuse error message. The `--socket` option ensures that the socket is instead on a filesystem that supports Unix domain sockets, avoiding the possibility of this failure. \n\nWhen experimenting with different options, it is important to delete the mounted data directory each time you recreate the container to try a new setting. If the MySQL container sees a populated data directory, it skips over most of the container initialization scripts and will not run. A common mistake when trying different container MySQL configuration options is to rerun `docker run` without deleting the data directory. Since the MySQL initialization doesn't run, nothing will have changed and it won't be clear why the behavior isn't changing.\n\nTherefore, to try a different set of MySQL options, execute the following command:\n\n```", "```js\\1\n\nThis executes the MySQL CLI client inside the newly created container. There are a few commands we can run to check the status of the `root` and `userauth` user IDs. These include the following:\n\n```", "```js\\1\n\nThis says that the `userauth` user has full access to the `userauth` database. The `root` user, on the other hand, has full access to every database and has so many permissions that the output of that does not fit here. Fortunately, the `root` user is only allowed to connect from `localhost`.\n\nTo verify this, try connecting from different locations using these commands:\n\n```", "```js\\1\n\nThis demonstrates that if the container is not attached to `authnet`, it cannot access the MySQL server because the `db-userauth` hostname is not even known.\n\nWhere did the `db-userauth` hostname come from? We can find out by inspecting a few things:\n\n```", "```js\\1\n\nThe `FROM` command specifies a pre-existing image, called the base image, from which to derive a given image. Frequently, you define a Docker image by starting from an existing image. In this case, we're using the official Node.js Docker image ([https://hub.docker.com/_/node/](https://hub.docker.com/_/node/)), which, in turn, is derived from `debian`.\n\nBecause the base image, `node`, is derived from the `debian` image, the commands available are what are provided on a Debian OS. Therefore, we use `apt-get` to install more packages. \n\nThe `RUN` commands are where we run the shell commands required to build the container. The first one installs required Debian packages, such as the `build-essential` package, which brings in compilers required to install native-code Node.js packages.\n\nIt's recommended that you always combine `apt-get update`, `apt-get upgrade`, and `apt-get install` in the same command line like this because of the Docker build cache. Docker saves each step of the build to avoid rerunning steps unnecessarily. When rebuilding an image, Docker starts with the first changed step. Therefore, in the set of Debian packages to install changes, we want all three of those commands to run.\n\nCombining them into a single command ensures that this will occur. For a complete discussion, refer to the documentation at [https://docs.docker.com/develop/develop-images/dockerfile_best-practices/](https://docs.docker.com/develop/develop-images/dockerfile_best-practices/).\n\nThe `ENV` commands define environment variables. In this case, we're using the same environment variables that were defined in the `package.json` script for launching the user authentication service.\n\nNext, we have a sequence of lines to create the `/userauth` directory and to populate it with the source code of the user authentication service. The first line creates the `/userauth` directory. The `COPY` command, as its name implies, copies the files for the authentication service into that directory. The `WORKDIR` command changes the working directory to `/userauth`. This means that the last `RUN` command, `npm install`, is executed in `/userauth`, and therefore, it installs the packages described in `/userauth/package.json` in `/userauth/node_modules`.\n\nThere is a new `SEQUELIZE_CONNECT` configuration file mentioned: `sequelize-docker-mysql.yaml`. This will describe the Sequelize configuration required to connect to the database in the `db-userauth` container.\n\nCreate a new file named `users/sequelize-docker-mysql.yaml` containing the following:\n\n```", "```js\\1\n\nAs has been our habit, this is an administrative task that we can record in `package.json`, making it easier to automate this task.\n\nWe can build the authentication service as follows:\n\n```", "```js\\1\n\nThis is the set of commands that were found to be useful to manage building the images, starting the containers, and stopping the containers.\n\nLook carefully and you will see that we've added `--detach` to the `docker run` commands. So far, we've used `docker run` without that option, and the container remained in the foreground. While this was useful to see the logging output, it's not so useful for deployment. With the `--detach` option, the container becomes a background task.\n\nOn Windows, for the -`-mount` option, we need to change the `src= parameter` (as discussed earlier) to use a Windows-style hard-coded path. That means it should read:\n\n```", "```js\\1\n\nThese commands build the pieces required for the user authentication service. As a side effect, the containers are automatically executed and will launch as background tasks.\n\nOnce it is running, you can test it using the `cli.mjs` script as before. You can shell into the `svc-userauth` container and run `cli.mjs` there; or, since the port is visible to the host computer, you can run it from outside the container.\n\nAfterward, we can manage the whole service as follows:\n\n```", "```js\\1\n\nThis prints out a large JSON object describing the network, along with its attached containers, which we've looked at before. If everything went well, we will see that there are now two containers attached to `authnet` where there'd previously have just been one.\n\nLet's go into the `svc-userauth` container and poke around:\n\n```", "```js\\1\n\nWe can run the `cli.mjs` script to test and administer the service. To get these database entries set up, use the `add` command with the appropriate options:\n\n```", "```js\\1\n\nFrom outside the containers, on the host system, we cannot ping the containers. That's because they are attached to `authnet` and are not reachable.\n\nWe have successfully Dockerized the user authentication service in two containers—`db-userauth` and `svc-userauth`. We've poked around the insides of a running container and found some interesting things. However, our users need the fantastic Notes application to be running, and we can't afford to rest on our laurels.\n\nSince this was our first time setting up a Docker service, we went through a lot of details. We started by launching a MySQL database container, and what is required to ensure that the data directory is persistent. We then set up a Dockerfile for the authentication service and learned how to connect containers to a common Docker network and how containers can communicate with each other over the network. We also studied the security benefits of this network infrastructure, since we can easily wall off the service and its database from intrusion.\n\nLet's now move on and Dockerize the Notes application, making sure that it is connected to the authentication server.\n\n# Creating FrontNet for the Notes application\n\nWe have the back half of our system set up in Docker containers, as well as the private bridge network to connect the backend containers. It's now time to do the same for the front half of the system: the Notes application (`svc-notes`) and its associated database (`db-notes`). Fortunately, the tasks required to build FrontNet are more or less the same as what we did for AuthNet.\n\nThe first task is to set up another private bridge network, `frontnet`. Like `authnet`, this will be the infrastructure for the front half of the Notes application stack.\n\nCreate a directory, `frontnet`, and in that directory, create a `package.json` file that will contain the scripts to manage `frontnet`: \n\n```", "```js\\1\n\nWe have two virtual bridge networks. Over the next few sections, we'll set up the database and Notes application containers, connect them to `frontnet`, and then see how to manage everything.\n\n## MySQL container for the Notes application\n\nAs with `authnet`, the task is to construct a MySQL server container using the `mysql/mysql-server` image. We must configure the server to be compatible with the `SEQUELIZE_CONNECT` file that we'll use in the `svc-notes` container. For that purpose, we'll use a database named `notes` and a `notes` user ID.\n\nFor that purpose, add the following to the `scripts` section of the `package.json` file:\n\n```", "```js\\1\n\nThis database will be available in the `db-notes` domain name on `frontnet`. Because it's attached to `frontnet`, it won't be reachable by containers connected to `authnet`. To verify this, run the following command:\n\n```", "```js\\1\n\nThis is similar to the Dockerfile we used for the authentication service. We're using the environment variables from `notes/package.json`, plus a new one: `NOTES_SESSION_DIR`.\n\nThe most obvious change is the number of `COPY` commands. The Notes application is a lot more involved, given the number of sub-directories full of files that must be installed. We start by creating the top-level directories of the Notes application deployment tree. Then, one by one, we copy each sub-directory into its corresponding sub-directory in the container filesystem.\n\nIn a `COPY` command, the trailing slash on the destination directory is important. Why? Because the Docker documentation says that the trailing slash is important, that's why.\n\nThe big question is *why use multiple *`COPY`* commands like this*? This would have been incredibly simple:\n\n```", "```js\\1\n\nThis will access a database server on the `db-notes` domain name using the named database, username, and password. \n\nNotice that the `USER_SERVICE_URL` variable no longer accesses the authentication service at `localhost`, but at `svc-userauth`. The `svc-userauth` domain name is currently only advertised by the DNS server on AuthNet, but the Notes service is on FrontNet. Therefore, this will cause a failure for us when we get to running the Notes application, and we'll have to make some connections so that the `svc-userauth` container can be accessed from `svc-notes`.\n\nIn [Chapter 8](1ef2de06-5b7d-44c8-a132-55f822d113cf.xhtml)*,* *Authenticating Users with a Microservice*, we discussed the need to protect the API keys supplied by Twitter. We could copy the `.env` file to the Dockerfile, but this may not be the best choice, and so we've left it out of the Dockerfile.\n\nUnfortunately, this does not protect the Twitter credentials to the level required. The `.env` file is available as plaintext inside the container. Docker has a feature, Docker Secrets, that can be used to securely store data of this sort. Unfortunately, it is only available when using Swarm mode, which we are not doing at this time; but we will use this feature in [Chapter 12](8551a26c-6834-4df6-b392-60a15c20f6ff.xhtml), *Deploying a Docker Swarm to AWS EC2 Using Terraform*.\n\nThe value of `TWITTER_CALLBACK_HOST` needs to reflect where Notes is deployed. Right now, it is still on your laptop, but if it is deployed to a server, this variable will require the IP address or domain name of the server.\n\nIn `notes/package.json`, add the following `scripts` entry:\n\n```", "```js\\1\n\nNow, we can build the container image:\n\n```", "```js\\1\n\nWe can reach `db-notes` from `svc-notes` but not `svc-userauth`. This is as expected since we have attached these containers to different networks.\n\nIf you inspect FrontNet and AuthNet, you'll see that the containers attached to each do not overlap:\n\n```", "```js\\1\n\nWith no other change, the Notes application will now allow you to log in and start adding and editing notes. Furthermore, start a shell in `svc-notes` and you'll be able to ping both `svc-userauth` and `db-userauth`.\n\nThere is a glaring architecture question staring at us. Do we connect the `svc-userauth` service to `frontnet`, or do we connect the `svc-notes` service to `authnet`? We just connected `svc-notes` to `authnet`, but maybe that's not the best choice. To verify which network setup solves the problem, run the following commands:\n\n```", "```js\\1\n\nThis sequence reconnects `svc-notes` to `authnet` and demonstrates the ability to access both the `svc-userauth` and `db-userauth` containers. Therefore, a successful invader could access the `db-userauth` database, a result we wanted to prevent. Our diagram in [Chapter 10](176ce11c-dd6f-4ebf-ba14-529be6db28da.xhtml), *Deploying Node.js Applications to Linux Servers,* showed no such connection between `svc-notes` and `db-userauth`.\n\nGiven that our goal for using Docker was to limit the attack vectors, we have a clear distinction between the two container/network connection setups. Attaching `svc-userauth` to `frontnet` limits the number of containers that can access `db-userauth`. For an intruder to access the user information database, they must first break into `svc-notes`, and then break into `svc-userauth`; unless, that is, our amateur attempt at a security audit is flawed.\n\nFor this and a number of other reasons, we arrive at this final set of scripts for `frontnet/package.json`:\n\n```", "```js\\1\n\nBecause we've automated many things, it is this simple to administer the system. However, it is not as automated as we want it to be. To address that, let's learn how to make the Notes stack more easily deployable by using Docker Compose to describe the infrastructure.\n\n# Managing multiple containers with Docker Compose\n\nIt is cool that we can create encapsulated instantiations of the software services that we've created. In theory, we can publish these images to Docker repositories, and then launch the containers on any server we want. For example, our task in [Chapter 10](176ce11c-dd6f-4ebf-ba14-529be6db28da.xhtml), *Deploying Node.js Applications to Linux Servers*, would be greatly simplified with Docker. We could simply install Docker Engine on the Linux host and then deploy our containers on that server, and not have to deal with all those scripts and the PM2 application.\n\nBut we haven't properly automated the process. The promise was to use the Dockerized application for deployment on cloud services. In other words, we need to take all this learning and apply it to the task of simplifying deployment.\n\nWe've demonstrated that, with Docker, Notes can be built using four containers that have a high degree of isolation from each other and from the outside world. \n\nThere is a glaring problem: our process in the previous section was partly manual, partly automated. We created scripts to launch each portion of the system, which is good practice. However, we did not automate the entire process to bring up Notes and the authentication services, nor is this solution scalable beyond one machine.\n\nLet's start with the last issue first—scalability. Within the Docker ecosystem, several **Docker orchestrator** services are available. An orchestrator automatically deploys and manages Docker containers over a group of machines. Some examples of Docker orchestrators are Docker Swarm, Kubernetes, CoreOS Fleet, and Apache Mesos. These are powerful systems that can automatically increase/decrease resources as needed to move containers from one host to another, and more. We mention these systems for you to further study as your needs grow. In [Chapter 12](8551a26c-6834-4df6-b392-60a15c20f6ff.xhtml), *Deploying a Docker Swarm to AWS EC2 with Terraform*, we will build on the work we're about to do in order to deploy Notes in a Docker Swarm cluster that we'll build on AWS EC2 infrastructure.\n\nDocker Compose ([https://docs.docker.com/compose/overview/](https://docs.docker.com/compose/overview/)) will solve the other problems we've identified. It lets us easily define and run several Docker containers together as a complete application. It uses a YAML file, `docker-compose.yml`, to describe the containers, their dependencies, the virtual networks, and the volumes. While we'll be using it to describe deployment on a single host machine, Docker Compose can be used for multi-machine deployments. Namely, Docker Swarm directly uses compose files to describe the services you launch in a swarm. In any case, learning about Docker Compose will give you a headstart on understanding the other systems.\n\nBefore proceeding, ensure that Docker Compose is installed. If you've installed Docker for Windows or Docker for Mac, everything that is required is installed. On Linux, you must install it separately by following the instructions in the links provided earlier.\n\n## Docker Compose file for the Notes stack\n\nWe just talked about Docker orchestration services, but Docker Compose is not itself such a service. Instead, Docker Compose uses a specific YAML file structure to describe how to deploy Docker containers. With a Docker Compose file, we can describe one or more containers, networks, and volumes involved in launching a Docker-based service.\n\nLet's start by creating a directory, `compose-local`, as a sibling to the `users` and `notes` directories. In that directory, create a file named `docker-compose.yml`:\n\n```", "```js\\1\n\nWe first needed to stop and delete any existing containers left over from our previous work. We can also use the scripts in the `frontnet` and `authnet` directories to do this. `docker-compose.yml` used the same container names, so we need the ability to launch new containers with those names.\n\nTo get started, use this command:\n\n```", "```js\\1\n\nWe can use `docker-compose stop` to shut down the containers. With `docker-compose start`, the containers run in the background.\n\nWe can also run `docker-compose up` to get a different experience:\n\n```", "```js\\1\n\nThis is related to running `docker ps`, but the presentation is a little different and more compact.\n\nIn `docker-compose.yml`, we insert the following declaration for `svc-userauth`:\n\n```", "```js\\1\n\nWe started the Docker containers using `docker-compose`, and we can use the `docker-compose` command to interact with the containers. In this case, we demonstrated using both the `docker-compose` and `docker` commands to execute a command inside one of the containers. While there are slight differences in the command syntax, it's the same interaction with the same results.\n\nAnother test is to go into the containers and explore:\n\n```", "```js\\1\n\n`svc-userauth` is no longer connected to `frontnet`, which is how we could ping `db-notes` from `svc-userauth`. Instead, `svc-userauth` and `svc-notes` are both connected to a new network, `svcnet`, which is meant to connect the service containers. Therefore, both service containers have exactly the required access to match the goals outlined at the beginning.\n\nThat's an advantage of Docker Compose. We can quickly reconfigure the system without rewriting anything other than the `docker-compose.yml` configuration file. Furthermore, the new configuration is instantly reflected in a file that can be committed to our source repository.\n\nWhen you're done testing the system, simply type *CTRL* +* C* in the terminal:\n\n```", "```js\\1\n\nThe `docker-compose` commands—`start`, `stop`*,* and `restart`—all serve as ways to manage the containers as background tasks. The default mode for the `docker-compose up` command is, as we've seen, to start the containers in the foreground. However, we can also run `docker-compose up` with the `-d` option, which says to detach the containers from the terminal to run in the background.\n\nWe're getting closer to our end goal. In this section, we learned how to take the Docker containers we've designed and create a system that can be easily brought up and down as a unit by running the `docker-compose` command.\n\nWhile preparing to deploy this to Docker Swarm on AWS EC2, a horizontal scaling issue was found, which we can fix on our laptop. It is fairly easy with Docker Compose files to test multiple `svc-notes` instances to see whether we can scale Notes for higher traffic loads. Let's take a look at that before deploying to the swarm.\n\n# Using Redis for scaling the Notes application stack\n\nIn the previous section, we learned how to use Docker Compose to manage the Notes application stack. Looking ahead, we can see the potential need to use multiple instances of the Notes container when we deploy to Docker Swarm on AWS EC2\\. In this section, we will make a small modification to the Docker Compose file for an ad hoc test with multiple Notes containers. This test will show us a couple of problems. Among the available solutions are two packages that fix both problems by installing a Redis instance.\n\nA common tactic for handling high traffic loads is to deploy multiple service instances as needed. This is called horizontal scaling, where we deploy multiple instances of a service to multiple servers. What we'll do in this section is learn a little about horizontal scaling in Docker by starting two Notes instances to see how it behaves.\n\nAs it currently exists, Notes stores some data—the session data—on the local disk space. As orchestrators such as Docker Swarm, ECS, and Kubernetes scale containers up and down, containers are constantly created and destroyed or moved from one host to another. This is done in the name of handling the traffic while optimizing the load on the available servers. In this case, whatever active data we're storing on a local disk will be lost. Losing the session data means users will be randomly logged out. The users will be rightfully upset and will then send us support requests asking what's wrong and whether we have even tested this thing!\n\nIn this section, we will learn that Notes does not behave well when we have multiple instances of `svc-notes`. To address this problem, we will add a Redis container to the Docker Compose setup and configure Notes to use Redis to solve the two problems that we have discovered. This will ensure that the session data is shared between multiple Notes instances via a Redis server.\n\nLet's get started by performing a little ad hoc testing to better understand the problem.\n\n## Testing session management with multiple Notes service instances\n\nWe can easily verify whether Notes properly handles session data if there are multiple `svc-notes` instances. With a small modification to `compose-local/docker-compose.yml`, we can start two `svc-notes` instances, or more. They'll be on separate TCP ports, but it will let us see how Notes behaves with multiple instances of the Notes service.\n\nCreate a new service, `svc-notes-2`, by duplicating the `svc-notes` declaration. The only thing to change is the container name, which should be `svc-notes-2`, and the published port, which should be port `3020`.\n\nFor example, add the following to `compose-local/docker-compose.yml`:\n\n```", "```js\\1\n\nIn this case, there was no source code change, only a configuration change. Therefore, the containers do not need to be rebuilt, and we can simply relaunch with the new configuration.\n\nThat will give us two Notes containers on different ports. Each is configured as normal; for example, they connect to the same user authentication service. Using two browser windows, visit both at their respective port numbers. You'll be able to log in with one browser window, but you'll encounter the following situation:\n\n![](img/642669ba-4d37-4eda-b870-a164aa968cc7.png)\n\nThe browser window on port `3020` is logged out, while the window open to port `3000` is logged in. Remember that port `3020` is `svc-notes-2`, while port `3000` is `svc-notes`. However, as you use the two windows, you'll observe some flaky behavior with regard to staying logged in. \n\nThe issue is that the session data is not shared between `svc-notes` and `svc-notes-2`. Instead, the session data is in files stored within each container.\n\nWe've identified a problem whereby keeping the session data inside the container makes it impossible to share session data across all instances of the Notes service. To fix this, we need a session store that shares the session data across processes.\n\n## Storing Express/Passport session data in a Redis server\n\nLooking back, we saw that we might have multiple instances of `svc-notes` deployed on Docker Swarm. To test this, we created a second instance, `svc-notes-2`, and found that user sessions were not maintained between the two Notes instances. This told us that we must store session data in a shared data storage system.\n\nThere are several choices when it comes to storing sessions. While it is tempting to use the `express-session-sequelize` package, because we're already using Sequelize to manage a database, we have another issue to solve that requires the use of Redis. We'll discuss this other issue later.\n\nFor a list of Express session stores, go to [http://expressjs.com/en/resources/middleware/session.html#compatible-session-stores](http://expressjs.com/en/resources/middleware/session.html#compatible-session-stores).\n\nRedis is a widely used key-value data store that is known for being very fast. It is also very easy to install and use. We won't have to learn anything about Redis, either.\n\nSeveral steps are required in order to set up Redis:\n\n1.  In `compose-local/docker-compose.yml`, add the following definition to the `services` section:\n\n```", "```js\\1\n\nAdd this to both the `svc-notes` and `svc-notes-2` service declarations. This passes the Redis hostname to the Notes service.\n\n3.  Next, install the package:\n\n```", "```js\\1\n\nThis brings in the Redis-based session store provided by `connect-redis`.\n\nThe configuration for these packages is taken directly from the relevant documentation.\n\nFor `connect-redis`, refer to [https://www.npmjs.com/package/connect-redis](https://www.npmjs.com/package/connect-redis). [](https://www.npmjs.com/package/connect-redis) For `redis`, refer to [https://github.com/NodeRedis/node-redis](https://github.com/NodeRedis/node-redis).\n\nThis imports the two packages and then configures the `connect-redis` package to use the `redis` package. We consulted the `REDIS_ENDPOINT` environment variable to configure the `redis` client object. The result landed in the same `sessionStore` variable we used previously. Therefore, no other change is required in `app.mjs`.\n\nIf no Redis endpoint is specified, we instead revert to the file-based session store. We might not always deploy Notes in a context where we can run Redis; for example, while developing on our laptop. Therefore, we require the option of not using Redis, and, at the moment, the choice looks to be between using Redis or the filesystem to store session data.\n\nWith these changes, we can relaunch the Notes application stack. It might help to relaunch the stack using the following command:\n\n```", "```js\\1\n\nThis installs the `socket.io-redis` package.\n\nThen, we configure it in `app.mjs`, as follows:\n\n```"]